from main.utils.requirements import *

params4eda = {
    'data_pth': 'data/tx_unfilterdata.csv', ## 数据集路径，最好给绝对路径
    'store_pth': 'test', ## eda结果的输出路径
    'oos_orgs': ['202412050001_光大信用卡_分期', '202408260001_上海银行', '202412040001_中原银行',
                  '202412040002_中原银行', '202406140001_分期乐_欺诈', '202403280002_长银消金_唯品会',
                 '202504210002_华通_360', '202408130001_洋钱罐', '202411040001_汇登数字', '202412090001_广州农商行'], ## oos机构
    'date_colName': 'apply_date', ## 日期列列名
    'y_colName': 'target', ## 标签列列名
    'org_colName': 'org', ## 可选，机构列列名，为None时生成唯一机构列标识
    'data_encode': 'utf-8', ## 读取数据的解码'GB2312', 'gbk', 'utf-8'
    'key_colNames' : ['matchingid'], ## 主键列，去重用
    'minYmBadsample': 5, ##建议5
    'minYmSample': 0, ## 建议500
    'channels': {'银行': ['202407100001_青岛银行', '202412110001_浦发信用卡_贷前',
                   '20241205_光大信用卡_提额', '202401210004_华夏银行（京东金条）',
                   '202503110003-上海银行信贷', '202503240001-晋商银行信用卡',
                   '202412110002_浦发信用卡_贷中监控', '202503110001-上海银行信贷', 
                   '202502250001-友利银行', '202410090001_华晨东亚汽车金融'],
           
               '24非银': ['20240328_长银消金_百融', '202403280001_长银消金_360','202504240001-南银法巴',
                      '202411150001_哈银金租', '202405290001_恒昌上海',
                      '20240802_度小满','202504210001_华通_乐信',
                      '202504090004_360_低利率', '202409260001_滴滴金融_新户', '202409260002_滴滴金融_老户'], 

               '36非银': ['202504210003_华通_拍拍贷','202504090003_360_高利率',
                         '202503120002-久恒融担', '202503120003-久恒融担', '202503120001-久恒融担', 
                       '202504010001-久恒融担', '202407090001_分期乐_贷中', '202503120002-久恒融担',
                        '202408300001_时光金科','202412300001_爱租机', '202412300002_爱租机',
                       '202409060001_恒昌北京_复贷', '202405290001_恒昌上海','202409060002_恒昌北京_新客'],

               '整体': ['202407100001_青岛银行', '202412110001_浦发信用卡_贷前',
                   '20241205_光大信用卡_提额', '202401210004_华夏银行（京东金条）',
                   '202503110003-上海银行信贷', '202503240001-晋商银行信用卡',
                   '202412110002_浦发信用卡_贷中监控', '202503110001-上海银行信贷', 
                   '202502250001-友利银行', '202410090001_华晨东亚汽车金融', '20240328_长银消金_百融', 
                      '202403280001_长银消金_360','202504240001-南银法巴',
                      '202411150001_哈银金租', '202405290001_恒昌上海',
                      '20240802_度小满','202504210001_华通_乐信',
                      '202504090004_360_低利率', '202409260001_滴滴金融_新户', '202409260002_滴滴金融_老户',
                      '202504210003_华通_拍拍贷','202504090003_360_高利率',
                         '202503120002-久恒融担', '202503120003-久恒融担', '202503120001-久恒融担', 
                       '202504010001-久恒融担', '202407090001_分期乐_贷中', '202503120002-久恒融担',
                        '202408300001_时光金科','202412300001_爱租机', '202412300002_爱租机',
                       '202409060001_恒昌北京_复贷', '202405290001_恒昌上海','202409060002_恒昌北京_新客'
                     ]}, ## 最少有一个渠道为整体{'整体': data.new_org.unique().to_list()}
    'missing_ratio': 0.6, ## 建议0.6
    'missing_orgcnt': 10, ## 建议总机构数的1/3
    'bin_method': 'quantile', ## 可选['quantile', 'dt'], 建议quantile
    'bin_cnt': 5, ## 建议5
    'miniv_org': 0.01, ## 建议0.01
    'miniv_channel': 0.05, ## 建议0.05
    'lowiv_orgcnt': 10, ## 建议总机构数的1/3
    'highpsi_orgcntnt': 10, ## 建议总机构数的1/3
    'max_psi': None, ## 建议0.1
    'corr_method': 'pearson', ## 可选['spearman', 'pearson'], 建议spearman
    'max_corr': 0.85 ## 建议0.85
}

paramspace = {'num_threads': 3, 
          'boosting_type': hp.choice('boosting_type', ['gbdt']),
          'num_iterations': scope.int(hp.quniform('num_iterations',80, 300, 5)), 
          'learning_rate':hp.quniform('learning_rate', 0.02, 0.07, 0.01),
          'colsample_bytree':hp.quniform('colsample_bytree',0.6, 0.95, 0.05),
          'max_depth': scope.int(hp.quniform('max_depth',3, 6, 1)), 
          'max_bin': scope.int(hp.quniform('max_bin',80, 200, 20)), 
          'min_child_weight': scope.int(hp.quniform('min_child_weight', 10, 40, 5)),
          'min_child_samples': scope.int(hp.quniform('min_child_samples', 20, 100, 20)),
          'reg_alpha': hp.quniform('reg_alpha', 1, 10, 1),
          'reg_lambda': hp.quniform('reg_lambda', 1, 10, 1),
          'balanced_badrate': hp.quniform('balanced_badrate', 0.1, 0.5, 0.05),
          'broadcast_with_tar': hp.choice('broadcast_with_tar', [False]), # 如果设置了balanced_badrate不为空 则参数不起作用
          'objective':'binary',
          'metric':'auc' # 请不要去掉此参数，如果有早停将作为依据
}

params4hyperopt = {'params': paramspace,
                   'fobj':None, ## 自定义损失函数
                   'max_iterations': 5, ## 最大寻优次数, 建议500
                   'auc_threshold':5e-2, ## 相对gap, 建议为0.05
                   'randn':42 ## 训练集验证机切分随机数种子
}

params4inference = {'score_name': 'tx_mixedScore_wo_balanced', ## 模型评分自定义名称
                    'child_score': 'model_risk_v8_gtongyong_score', ## 入模子分，为了模型效果比对使用，暂时只支持输入单个
                   'score_transform_func':None ## 分数转换函数
}